app/Helpers/custom_helper.php

function updateLastLogin($conn,$user_id,$time) {
	date_default_timezone_set('Asia/Kolkata');
    $conn->table('users')->where('id', $user_id)->update(['last_login' =>$time]);
---
UPDATE `users` SET `last_login` = '2024-12-20 07:48:27'
WHERE `id` = '22'