app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'vikash@gmail.com'
 LIMIT 1
SELECT *
FROM `roles`
WHERE `id` = '2'
 LIMIT 1
---
    public function login()
    {
        $email = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();

        if (!$user || !password_verify($password, $user['password'])) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Invalid credentials']);
        }

        $time=date('Y-m-d H:i:s');
        updateLastLogin($this->db,$user['id'],$time);
        $token = $this->jwt->generateToken(['id' => $user['id'], 'email' => $user['email'], 'role'=> $user['role']]);


        $roleModel = new RoleModel();
        $roleData = $roleModel->where('id', $user['role'])->first();