app/Controllers/UserController.php

SELECT `id`, `first_name`, `last_name`, `email`, `role`, `profile_img`
FROM `users`
ORDER BY `id` DESC
 LIMIT 5
---
    public function index()
    {
        $items = $this->userModel->select('id, first_name, last_name, email, role, profile_img,')->orderBy('id', 'DESC')->limit(5)->findAll();

SELECT *
FROM `users`
WHERE `email` = 'vikash@gmail.com'
 LIMIT 1
INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`, `role`, `profile_img`) VALUES ('vikash', 'kumar', 'vikash@gmail.com', '$2y$10$3FjwTS.6zdbj7uXBW1RjEeoUq2HOki4rWLKygldaFVSp2Tu8f.Z.2', '2', 'user_img_767652129138563.41480200.png')
---

        ];
        $userModel = new UserModel();
        if ($userModel->where('email', $email)->first()) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Username already exists'])->setStatusCode(409);
        }
        $this->userModel->insert($userdata);

INSERT INTO `user_education` (`course_name`, `passing_year`, `user_id`) VALUES ('BCA', '2017', 22)
---
                'passing_year' => $this->request->getVar('passing_year'),
                'user_id' => $userId,
            ];
            $educationModel->insert($educationData);

INSERT INTO `user_employment` (`company_name`, `position`, `user_id`) VALUES ('Indev', 'PHP Developer', 22)
---
                'position' => $this->request->getVar('position'),
                'user_id' => $userId,
            ];
            $employmentModel->insert($employmentData);

SELECT `users`.`id`, `users`.`first_name`, `users`.`last_name`, `users`.`email`, `users`.`role`, `users`.`profile_img`, `user_education`.`course_name`, `user_education`.`passing_year`, `user_employment`.`company_name`, `user_employment`.`position`, `roles`.`role_name`, `user_education`.`id` as `education_id`, `user_employment`.`id` as `employment_id`
FROM `users`
INNER JOIN `roles` ON `roles`.`id` = `users`.`role`
INNER JOIN `user_education` ON `user_education`.`user_id` = `users`.`id`
INNER JOIN `user_employment` ON `user_employment`.`user_id` = `users`.`id`
WHERE `users`.`id` = '20'
 LIMIT 1
---
    public function show($id)
    {

        $userModel = new UserModel();
        $data = $userModel->select('users.id, users.first_name, users.last_name, users.email, users.role, users.profile_img, user_education.course_name, user_education.passing_year, user_employment.company_name, user_employment.position,roles.role_name,user_education.id as education_id,user_employment.id as employment_id')
            ->join('roles', 'roles.id = users.role', 'inner')
            ->join('user_education', 'user_education.user_id = users.id', 'inner')
            ->join('user_employment', 'user_employment.user_id = users.id', 'inner')
            ->where('users.id', $id)
            ->first();